> Which version of Terraform and the Terraform AWS provider were you running?

```
$ terraform -version
Terraform v1.0.7
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v3.69.0
+ provider registry.terraform.io/hashicorp/null v3.1.0
+ provider registry.terraform.io/hashicorp/template v2.2.0
```

Here's the full logs when trying to do the initial deployment:

<details>
<summary> deployment output </summary>

```
$ terraform apply
provider.aws.region
  The region where AWS operations will take place. Examples
  are us-east-1, us-west-2, etc.

  Enter a value: us-west-2


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.chalice_api_swagger will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "chalice_api_swagger"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # aws_api_gateway_deployment.rest_api will be created
  + resource "aws_api_gateway_deployment" "rest_api" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "sha1(jsonencode(aws_api_gateway_rest_api.rest_api.body))"
        }
    }

  # aws_api_gateway_rest_api.rest_api will be created
  + resource "aws_api_gateway_rest_api" "rest_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = [
          + "application/octet-stream",
          + "application/x-tar",
          + "application/zip",
          + "audio/basic",
          + "audio/ogg",
          + "audio/mp4",
          + "audio/mpeg",
          + "audio/wav",
          + "audio/webm",
          + "image/png",
          + "image/jpg",
          + "image/jpeg",
          + "image/gif",
          + "video/ogg",
          + "video/mpeg",
          + "video/webm",
        ]
      + body                         = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "testtf4"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "EDGE",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.rest_api will be created
  + resource "aws_api_gateway_stage" "rest_api" {
      + arn           = (known after apply)
      + deployment_id = "aws_api_gateway_deployment.rest_api.id"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "api"
      + tags_all      = (known after apply)
    }

  # aws_iam_role.default-role will be created
  + resource "aws_iam_role" "default-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "testtf4-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.default-role will be created
  + resource "aws_iam_role_policy" "default-role" {
      + id     = (known after apply)
      + name   = "default-rolePolicy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_lambda_function.api_handler will be created
  + resource "aws_lambda_function" "api_handler" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./deployment.zip"
      + function_name                  = "testtf4-dev"
      + handler                        = "app.app"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "pw8U6yDNXo4FZ9oB7/5+6RsUbs/ZWxlUIsaBae2McQ8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "aws-chalice" = "version=1.26.2:stage=dev:app=testtf4"
        }
      + tags_all                       = {
          + "aws-chalice" = "version=1.26.2:stage=dev:app=testtf4"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.tf3asdf will be created
  + resource "aws_lambda_function" "tf3asdf" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./deployment.zip"
      + function_name                  = "testtf4-dev-tf3asdf"
      + handler                        = "app.tf3asdf"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "pw8U6yDNXo4FZ9oB7/5+6RsUbs/ZWxlUIsaBae2McQ8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "aws-chalice" = "version=1.26.2:stage=dev:app=testtf4"
        }
      + tags_all                       = {
          + "aws-chalice" = "version=1.26.2:stage=dev:app=testtf4"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.rest_api_invoke will be created
  + resource "aws_lambda_permission" "rest_api_invoke" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + EndpointURL     = (known after apply)
  + RestAPIId       = (known after apply)
  + RestAPIStageArn = "aws_api_gateway_stage.rest_api.arn"
╷
│ Warning: Version constraints inside provider configuration blocks are deprecated
│
│   on chalice.tf.json line 108, in provider.template:
│  108:       "version": "~> 2"
│
│ Terraform 0.13 and earlier allowed provider version constraints inside the provider configuration block, but that is now deprecated and will be removed in a future version of Terraform. To silence this warning, move the provider version constraint
│ into the required_providers block.
│
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated Resource
│
│   with data.null_data_source.chalice,
│   on chalice.tf.json line 133, in data.null_data_source.chalice:
│  133:       }
│
│ The null_data_source was historically used to construct intermediate values to re-use elsewhere in configuration, the same can now be achieved using locals
│
│ (and one more similar warning elsewhere)
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_role.default-role: Creating...
aws_iam_role.default-role: Creation complete after 0s [id=testtf4-dev]
aws_iam_role_policy.default-role: Creating...
aws_lambda_function.tf3asdf: Creating...
aws_lambda_function.api_handler: Creating...
aws_iam_role_policy.default-role: Creation complete after 0s [id=testtf4-dev:default-rolePolicy]
aws_lambda_function.api_handler: Still creating... [10s elapsed]
aws_lambda_function.tf3asdf: Still creating... [10s elapsed]
aws_lambda_function.api_handler: Creation complete after 17s [id=testtf4-dev]
data.template_file.chalice_api_swagger: Reading...
data.template_file.chalice_api_swagger: Read complete after 0s [id=90e1aaf9b378b69eacb2084c4f0ee36dd01612f6125a5fe076ffe211161cc47b]
aws_api_gateway_rest_api.rest_api: Creating...
aws_lambda_function.tf3asdf: Still creating... [20s elapsed]
aws_api_gateway_rest_api.rest_api: Creation complete after 3s [id=nx0v3ghb25]
aws_api_gateway_deployment.rest_api: Creating...
aws_api_gateway_stage.rest_api: Creating...
aws_api_gateway_deployment.rest_api: Creation complete after 1s [id=9k6u7g]
aws_lambda_permission.rest_api_invoke: Creating...
aws_lambda_permission.rest_api_invoke: Creation complete after 1s [id=terraform-20211213224149419900000001]
aws_lambda_function.tf3asdf: Creation complete after 24s [id=testtf4-dev-tf3asdf]
╷
│ Error: Error creating API Gateway Stage: BadRequestException: Deployment id does not exist
│
│   with aws_api_gateway_stage.rest_api,
│   on chalice.tf.json line 89, in resource.aws_api_gateway_stage.rest_api:
│   89:       }
│
╵

```

</details>

We'd need to come up with something so that users with existing chalice apps deployed with terraform can upgrade Chalice without the new template replacing any resources, and without any additional actions on their part (so any existing CI/CD setups continue to work).

Worst case scenario, we may need to toggle this updated tf template generation behind a config file option until we get to a 2.0 release, but ideally we can come up with a way to do this in a backwards compatible way.